abbreviation
abort
about
academic
accept
accordion
action
actions
add
additional
affected
afghan
afternoon
alert
aliases
all
allow
allowed
already
alternative
and
animate
another
any
api
applicable
apply
arb
arbitrary
are
area
array
arrow
assertion
assign
assigned
assignment
assignments
async
attempt
authority
auto
autoprefixer
availability
available
avatar
background
badge
badges
balanced
banner
bar
base
batch
best
bidirectional
blocked
blocking
body
border
boundary
break
breakdown
breaks
browser
build
builder
bulk
button
buttons
cache
cached
caches
calculate
calculation
calculations
calculator
can
cancel
candidate
capability
capacity
caption
card
cards
cascading
case
cases
casing
catch
categories
categorize
category
cell
cells
change
changes
character
check
checkbox
checker
checking
checklist
checks
chip
clamp
class
classes
clear
client
clone
cloners
clsx
cmdk
code
coding
collapsible
collect
color
colors
column
columns
combined
command
compatibility
compatible
compiler
completed
completion
component
components
composite
compute
computed
config
configs
configuration
confirm
confirmation
conflict
conflicts
consecutive
consistent
constants
constraint
constraints
constructor
container
contains
content
context
contrast
control
convention
core
count
coverage
coverages
create
critical
crud
css
current
curriculum
custom
dashboard
data
date
day
days
debug
default
defaults
define
definition
definitions
delay
delete
deleted
demo
dependencies
deps
derive
derived
description
descriptions
deserialize
detail
details
detect
detection
determine
dev
devtools
dialog
did
difficult
dimensions
direction
directional
dirty
disabled
display
dnd
dom
domain
domains
down
download
drag
draggable
drawer
drop
dropdown
droppable
duplicate
duration
durations
dynamic
ecma
edit
editable
editor
effective
elapsed
element
ellipsis
emit
empty
enable
enabled
encouragement
enhance
enhanced
enrich
enriched
ensure
entities
entity
entries
entry
enum
env
equal
equivalent
error
errors
escape
eslint
eslintrc
estimate
event
exceeded
excel
execute
execution
exhaustive
expected
explicit
export
exporting
extends
extensions
extract
fallback
fallthrough
farsi
fast
feature
features
fetch
field
fields
file
filename
filter
filters
find
first
flat
focus
focused
font
fontsource
footer
for
force
form
format
framer
from
full
generalist
generate
generated
generation
get
good
grade
grades
grid
group
grouped
guard
guidance
handle
handler
handling
hard
has
hash
head
header
hex
hints
history
hook
hookform
hooks
hours
hsl
hub
icon
icons
identity
ids
ignore
image
immer
impact
import
imported
importing
imports
inactive
include
incompatibility
index
indexes
indicator
info
initial
initials
input
inputs
insert
inspector
integration
interaction
intersection
invalid
invalidate
invalidation
iso
isolated
issue
issues
item
items
jest
job
jsdom
json
jsx
key
keyboard
keys
keywords
kit
label
labels
language
languages
last
latest
layout
lesson
lessons
letters
level
levels
lib
library
license
lightness
limit
limits
link
links
lint
list
load
loading
local
locale
locals
log
logger
logic
logout
longer
lookups
low
lucide
luminance
machine
main
manager
manual
map
maps
match
matrix
max
measure
memo
menu
merge
message
messages
meta
metadata
method
metric
metrics
minimal
ministry
minutes
mismatch
mock
mode
models
modes
module
modules
more
most
motion
move
multi
mutations
name
names
nav
navigation
near
nested
next
node
non
normalize
normalized
not
note
notification
notifications
notify
null
number
object
observer
old
onboarding
one
only
operation
optimistic
optimization
optimized
option
options
order
outcome
output
over
overall
overlay
override
overrides
overview
package
page
paginated
pagination
pair
panel
parameters
parse
parsed
parser
parsers
partial
parts
paste
paths
patterns
payload
pending
per
percentage
performance
period
periods
persian
phase
pick
picker
placeholder
plugin
plugins
popover
populate
population
position
postcss
prayer
preference
preferences
prefetch
prefix
preservation
preset
presets
prettier
preview
previous
primary
priority
problem
process
progress
projection
promote
prop
property
props
push
quality
query
quick
radio
radix
ramadan
range
ranges
rank
ranking
ratio
raw
react
read
readiness
ready
realtime
reason
recommended
record
redo
references
register
registries
related
relative
remaining
remap
removal
remove
removed
render
rendered
rendering
reorder
request
required
requirement
requirements
requires
reset
resize
resolution
resolutions
resolve
resolved
resolvers
resource
resources
response
restrictio
result
retry
retryable
return
returns
revert
review
rgb
room
rooms
root
round
route
router
row
rsc
rtl
rules
run
safe
sample
sanitize
save
saved
schedule
scheduled
schedules
schema
schemas
school
scope
score
scripts
scroll
search
section
sections
seed
select
selected
selection
selector
separator
sequence
serialization
serialize
serialized
service
set
settings
setup
severe
severity
sheet
shift
shifts
shortcut
shortcuts
should
show
sidebar
signature
simple
simulate
since
single
size
skeleton
skip
sleep
slider
slot
slots
smart
snapshot
soft
solution
solver
sonner
sort
sortable
source
special
specific
stale
start
stat
state
states
statistics
stats
status
step
stepper
storage
store
stored
stores
strategy
strict
string
stringify
strip
structure
style
styles
sub
subject
subjects
success
suggest
suggestion
suggestions
summaries
summarize
summary
swap
switch
switcher
switches
sync
synthetic
tab
table
tabs
tag
tailwind
tailwindcss
tanstack
target
targets
teach
teacher
teachers
template
term
terminal
test
testing
text
textarea
this
thresholds
time
timeline
times
timetable
timetables
timezone
timezones
title
toast
toaster
toggle
toggles
tooltip
total
transform
transformer
translate
translation
translations
trial
trigger
trip
truncate
tsconfig
tsx
type
types
typescript
unassign
unassignments
unavailable
undo
unified
uniform
unique
unsaved
unused
update
url
use
used
utilities
utilization
utils
valid
validate
validated
validates
validation
value
values
variables
variance
variants
vars
vazirmatn
version
view
views
violation
virtualized
visual
vite
vitejs
vitest
warning
warnings
watch
web
week
weight
weights
whitespace
with
without
wizard
workload
workloads
wrapper
xlsx
zod
zone
zustand