abbreviation
abc
abort
about
academic
accept
accessing
accessor
accordion
across
action
actionable
actions
activate
active
add
added
adding
additional
adjacency
adjustments
advanced
affected
afghan
afghanistan
after
afternoon
age
aggregate
aggregated
ahmad
alert
aliases
all
allocation
allow
allowed
allows
already
also
alternative
although
always
amount
analysis
analyze
analyzer
and
animate
annual
answer
any
api
app
appear
applicable
application
applied
applies
apply
applying
approach
approaches
appropriate
architecture
archive
archived
are
area
arg
args
argument
array
arrow
artifact
asar
ass
assert
assessment
asset
assign
assigne
assigned
assignement
assignening
assigning
assignment
assignmentdrawerv
assignments
asymmetric
async
atomic
attributes
audit
author
authority
auto
automatic
autoprefixer
availability
available
avatar
avoid
aware
axios
backend
backfill
background
backoff
backup
backups
backward
badge
badges
balance
balanced
band
bands
bank
banner
bar
base
based
baseline
bash
batch
because
becoming
before
begin
behavior
beneficial
benefits
bert
best
better
between
bfs
bidirectional
block
blocked
blocker
blockers
blocking
blocks
body
booked
bool
boolean
bootstrap
both
bound
boundary
bounds
bracket
break
breakdown
breaks
bridge
browser
bucket
buckets
bugs
build
builder
building
builds
built
bulk
but
button
buttons
bytes
cache
cached
caches
calculate
calculates
calculation
calculations
calendar
call
can
cancel
cancellation
cancelled
candidate
cannot
canonical
capabilities
capability
capacity
caption
card
cards
cascading
cases
casing
catalog
catch
categories
categorize
category
cell
change
changeable
changed
changes
channels
character
chat
che
cheat
cheatsheet
check
checkbox
checker
checking
checklist
checkpoint
checkpoints
checks
child
children
chip
choose
chroma
chunk
chunker
chunking
chunks
clamp
clas
class
classassignmentrow
classes
classification
clean
cleanup
clear
cli
click
client
clone
cloners
close
clsx
clust
cluster
clustering
clusters
cmd
cmdk
cod
code
codebase
codes
coding
collapsible
colleague
colleagues
collect
collection
color
colorize
colors
column
columns
comb
combinations
combined
combines
comma
command
commands
comments
committed
common
compact
comparable
compare
compat
compatibility
compatible
compiler
complete
completed
completion
complex
component
components
compose
composite
comprehensive
compute
computed
con
concurrently
conf
config
configs
configuration
configurations
configure
configured
configuring
confirm
confirmation
confirmed
conflict
conflicts
connected
connection
consecutive
consistency
consistent
console
const
constants
constra
constrai
constrain
constraint
constraints
constructor
consume
consumption
contact
contains
content
context
contexts
contract
contracts
contractual
contrast
control
controls
convenience
convention
convert
core
correctly
corrupt
corrupted
cors
count
counter
counters
counts
coverage
coverages
creat
create
created
creates
creation
critical
cross
cruiser
crypto
css
cumulative
current
curriculum
custom
dari
darken
dashboard
data
datab
database
date
day
days
deactivate
debug
dec
decide
decides
decisions
declaration
decompose
decomposit
decomposition
decorator
decorators
decrem
decrement
dedupe
deep
default
defaults
define
defined
defines
definition
definitions
degraded
delay
delete
deleted
deletes
demo
dependencies
dependency
deprecated
deps
derive
derived
describe
description
descriptions
deserialize
design
desired
destroy
destructive
detail
detailed
details
detect
detection
determine
dev
development
device
devtools
diagnos
diagnostic
diagnostics
dialog
dictionaries
dictionary
did
difficult
dim
dimension
dir
direction
directional
directly
directories
directory
dis
disable
disabled
disk
display
disruption
dist
distinct
distributed
distribution
distributions
dnd
docker
does
dom
domain
domains
don
dont
double
down
download
draft
drag
draggable
drawer
drift
drop
dropdown
droppable
dry
dto
dump
duplicate
duplicates
duration
durations
during
dynamic
each
early
edit
editable
editing
editor
educat
effective
effici
efficiency
efficiently
effort
either
elapsed
electron
ellipsis
embed
embedded
embedder
embedding
embeddings
emit
emits
employment
empty
ena
enable
enabled
encouragement
end
enforce
enforces
english
enhance
enhanced
enqueue
enrich
enriched
ensu
ensure
ensures
enter
entities
entity
entries
entry
entrypoint
enum
env
environment
environments
equal
err
error
errors
escape
eslint
estimate
etc
evaluate
even
evenly
event
every
evict
exact
exactly
examples
exceed
exceeded
exceeds
excel
exceljs
exception
exceptions
exclude
executable
execute
executes
execution
executor
exist
existing
exists
exit
expected
experimental
expiration
expired
explicit
exponential
export
exporter
exporting
exports
exposed
exposition
express
extensions
extra
extract
face
factory
fail
failed
fails
failure
fallback
fallthrough
farsi
fast
feasibility
feasible
feature
features
feedback
fetch
field
fields
fil
file
filename
files
filter
filtered
filtering
filters
find
finds
finish
first
fit
fits
five
fix
fixed
fixing
flags
flat
flatten
flow
flush
focus
focused
focusing
follow
following
font
fonts
fontsource
footer
for
force
foreign
fork
form
format
formats
formatted
formatting
found
four
framer
free
freeze
friendly
from
frontend
full
function
functions
future
gap
garbage
gather
gatherer
gauge
gauges
gen
general
generalist
generate
generated
generating
generation
get
gets
getting
given
global
globals
good
gracefully
grade
grades
grant
graph
grid
group
grouped
guard
guidance
guide
guidelines
hand
handle
handled
handler
handlers
hard
harden
has
hash
hashable
have
hawala
head
header
heading
headteacher
headteachers
health
height
help
helpers
here
hex
high
higher
hints
histogram
histograms
history
home
homepage
hoo
hook
hookform
hooks
host
hours
how
hsl
html
http
https
hub
hugging
human
icon
icons
ide
iden
ident
identifie
identifier
identifiers
identifies
identity
ids
image
immer
impact
implem
impleme
implement
implementation
implementations
implemented
implements
import
imported
importing
imports
impossible
improvements
improving
inactive
inc
include
includes
including
inclusion
incompatibility
incompatible
inconsistency
incr
increases
increm
increment
incremented
indent
independence
independent
independently
index
indexable
indexed
indexer
indexes
indexing
indicating
indicator
infeasible
infer
info
informa
information
inherit
init
initial
initialization
initialize
initials
input
inputs
insert
inside
inspector
install
installation
instance
instances
instead
instructions
int
integer
integration
integrations
integrity
intelligently
interaction
interactive
interface
intermediate
internal
interop
interval
intervals
into
invalid
invalidate
invalidation
invariant
ipc
isolated
issue
issued
issues
item
items
its
jest
job
jobs
jsdom
json
jsx
just
key
keyboard
keys
keywords
kit
labe
label
labels
language
languages
large
last
later
latest
layers
layout
leading
leaf
least
ledger
legacy
len
length
less
lesson
lessons
lets
letters
leve
level
levels
lib
library
license
licenses
lightness
like
limit
limits
line
lines
link
links
lint
list
llm
load
loader
loading
loads
loca
local
locale
localhost
localize
localized
locals
lock
log
logger
logging
logic
logout
logs
longer
looks
lookup
lookups
low
lru
lucide
luminance
machine
madge
main
mainly
make
maktab
manageable
managed
management
manager
manages
manual
manually
map
mapping
mappings
maps
mark
markdown
match
matches
matching
materialization
materialize
matrix
max
maxperiodsperw
measure
measured
megabytes
memo
memory
menu
merge
merged
merger
merges
message
messages
meta
metadata
meth
method
metric
metrics
middleware
migrate
migration
migrations
min
minimal
minimum
ministry
minutes
mirror
mismatch
missing
mobile
mock
mocks
modal
mode
model
models
modify
modular
module
modules
money
monitoring
more
morning
most
motion
move
moved
moves
much
mult
multi
multiple
must
mutation
mutations
name
named
names
namespace
naming
native
nav
navigation
ndarray
near
necessary
needed
needs
nested
never
new
next
node
nodemon
nodes
non
normalization
normalize
normalized
normalizer
not
note
notes
notification
notifications
notify
now
nsis
null
nullable
number
numbers
objec
object
objective
objectives
observ
observation
observations
observe
occupancy
offset
old
older
onboarding
one
only
open
opened
operation
operational
operations
oppor
opportunities
opportunity
optimal
optimistic
optimization
optimizations
optimize
optimized
optimizer
optimizes
option
optional
optionally
options
orchestrates
orchestrator
order
origin
original
origins
ormconfig
other
out
outcome
output
outside
over
overall
overhead
overlap
overlay
override
overrides
own
owned
pack
package
packaged
packages
page
paginate
paginated
pagination
paint
pair
pairs
pairwise
panel
parallel
param
parameters
params
parens
parent
parity
parse
parsed
parser
parsers
part
partial
partitioni
partitions
parts
party
paste
pasted
pasting
path
paths
pattern
patterns
pause
pausi
payload
payloads
payment
pdf
pending
per
percentage
perform
performance
performs
period
periods
permission
persian
persistence
persistent
phase
pick
picker
pieces
place
placeholder
places
plan
planner
playwright
please
plugin
plugins
point
policy
pool
pools
popover
populate
population
port
ports
position
positions
positive
postcss
pragma
prayer
pre
preference
preferences
preferred
prefetch
prefix
prefixes
preload
prepare
preparing
prerequisites
preserves
preset
presets
prettier
prettierrc
pretty
prevention
prevents
preview
previous
pricing
primarily
primary
print
prints
prioritized
priority
pro
problem
problems
process
processed
processes
processing
product
production
profile
progre
progress
project
projection
prometheus
proper
properly
property
proposal
props
prose
protocol
provides
prune
psutil
push
python
quality
quantize
query
querying
queue
quick
quote
quoted
radio
radix
raised
ramadan
range
ranges
rank
rare
rate
rather
ratio
raw
react
read
readable
readiness
readme
reads
ready
real
realtime
reason
rebuild
recommended
reconcile
reconstruct
record
records
redi
redis
redo
reduce
refactored
reference
references
reflect
refreshing
regis
register
registered
registries
registry
reject
rejected
rejects
related
relation
relationships
relative
relevant
remain
remainder
remaining
remains
remap
remediation
removal
remove
removed
render
renderer
repair
replace
report
reporter
reporting
reports
repository
repr
representation
representing
represents
req
request
requested
requests
requir
require
required
requirement
requirements
requires
requiring
res
reset
resolution
resolutions
resolve
resolved
resolvers
resou
resource
resources
respe
respecting
response
restart
restore
restrictio
result
results
resume
retried
retrieve
retry
retryable
return
returned
returns
revert
review
reviewed
revision
rgb
rollback
rollup
room
rooms
root
round
route
router
routes
row
rows
rsc
rtl
rule
rules
run
running
runs
runtime
safe
same
sanitize
sat
satisfaction
satisfied
satisfy
save
saved
saving
scalar
schedule
scheduled
scheduler
schedules
scheduling
schema
schemas
school
scope
scoped
scopes
score
scorer
screen
script
scripts
scroll
search
searches
searching
sec
secondary
seconds
section
sections
seed
sel
select
selected
selection
selector
selects
semantic
semi
semicolons
send
sensitivity
sentence
separator
serialization
serialize
serialized
server
service
services
set
sets
setti
settings
setup
severe
severity
shape
share
shared
sharing
sheet
shell
shift
shifts
short
shortcut
shortcuts
shorten
should
show
shows
shutdown
sidebar
signature
simple
simplify
simulated
since
single
singleton
size
sizes
skeleton
skip
sleep
slot
slots
slug
small
smaller
smart
smartly
snapshot
soft
solution
solutions
solve
solved
solver
solves
solving
sonner
sort
sortable
sorted
source
space
spacing
span
spare
spawn
spec
special
specific
specified
spl
split
spread
sql
sqlite
squirrel
src
stability
stack
staff
stage
stages
stale
staleness
standard
standardized
start
started
starting
starts
startup
stat
state
states
statistics
stats
status
stderr
stdin
stdout
steering
step
stepper
steps
still
stop
storage
store
stored
stores
storing
str
strategies
strategy
stream
strength
strict
strictly
string
stringify
strings
strip
structlog
structure
structured
style
styles
styling
sub
subje
subject
subjects
submit
subprocess
subset
success
successfu
successful
sufficient
suggest
suggestion
suggestions
sum
summaries
summarize
summary
sums
support
supporte
supported
supports
swap
swaps
switch
switcher
sync
synchronization
synchronize
synthetic
system
tab
table
tables
tabs
tag
tags
tailwind
tailwindcss
take
tan
tanstack
target
targets
task
teach
teacher
teachers
teaching
tear
teardown
technology
temp
template
templates
term
terminal
terminate
test
testing
tests
text
textarea
texts
than
that
the
their
then
these
they
think
third
this
thorough
though
thresholds
through
throw
tile
time
timeline
timeout
timer
times
timestamp
timetab
timetable
timetables
timetabling
timezone
timezones
timing
tips
title
toast
toaster
todo
toggle
toggles
token
toolbar
tooltip
total
track
tracker
tracking
trailing
transaction
transform
transformation
transformer
transformers
translate
translation
translations
tree
tri
trial
trigger
triggers
trip
troubleshooting
true
truncate
truth
try
tsconfig
tsx
tuple
tuples
two
typ
type
typeorm
types
typescri
typescript
unambiguous
unassign
unassignments
unavailability
unavailable
unchanged
undo
unexpected
unified
unique
unit
units
unknown
unpack
unpaginated
unregister
unsaved
unused
update
updater
updates
upgrade
upsert
url
usable
usage
use
used
useful
user
users
uses
using
utilities
utilization
utils
uuid
vacuum
val
valid
validate
validated
validates
validation
validations
validator
valu
value
values
var
variable
variables
variance
variants
vazirmatn
verification
verifies
verify
version
very
via
view
views
violates
violation
violations
visible
vite
vitejs
vitest
vue
wait
warn
warning
warnings
web
week
weekly
weight
were
what
whe
when
where
whethe
whether
while
whitespace
whole
whose
why
wide
width
win
window
wipe
with
within
without
wizard
work
worker
workers
workflow
working
workload
workloads
works
worksheet
workspace
workspaces
world
would
wrap
wrapper
write
writes
wrong
xlsx
yaml
year
yet
you
your
zero
zip
zod
zone
zsh
zustand